feat: add mermaid architect in README
